import {periodType} from "../components/ChronoSlider/ChronoSlider";


export const periods: periodType[] = [
    {
        title: 'Наука',
        left: 1969,
        right: 1999,
        data: [
            {
                title: "1969 ",
                text: "Высадка человека на Луну. «Это небольшой шаг для человека, но огромный скачок для человечества»"
            },
            {
                title: "1969",
                text: "Рождение Интернета. Через месяц после подключения Стэнфордского института из лаборатории Клейнрока туда было послано первое межкомпьютерное сообщение."
            },
            {
                title: "1980 ",
                text: "8 мая 1980 года Всемирная организация здравоохранения (ВОЗ) объявила о полной победе над оспой"
            },
            {
                title: "1986",
                text: "Авария на Чернобыльской АЭС"
            },
            {
                title: "1996 ",
                text: "Первое официальное клонирование животных. шотландец И. Уилмут получает хирургическим путём знаменитую овечку Долли — генетическую копию взрослой овцы. "
            },
        ]
    },
    {
        title: 'Музыка',
        left: 1962,
        right: 1981,
        data: [
            {
                title: "1962",
                text: "Рождение группы «Битлз». Число их проданных и продаваемых записей близится к миллиарду. Такого не знал ни один композитор, ни один исполнитель за всю историю человечества."
            },
            {
                title: "1970",
                text: "Queen - английская рок-группа, созданная в 1970 году."
            },
            {
                title: "1981  ",
                text: "Metallica. Группа вошла в мейнстрим из-за своего альбома под названием «Self-Titled» и сингла «Enter Sandman»."
            },
        ]
    },
    // {
    //     title: 'Кино',
    //     left: 1945,
    //     right: 1958,
    //     data: []
    // },
    // {
    //     title: 'Искусство',
    //     left: 1985,
    //     right: 1999,
    //     data: []
    // },
    {
        title: 'Политика',
        left: 1963,
        right: 1999,
        data: [
            {
                title: "1963",
                text: "Убийство президента Кеннеди. Две трети американцев убеждены: официальные круги скрывают правду об убийстве, и Джон Кеннеди пал жертвой заговора."
            },
            {
                title: "1975",
                text: "Установление диктатуры «красных кхмеров». В многострадальной Камбодже установился долгожданный мир."
            },
            {
                title: "1985",
                text: "Перестройка в СССР и реформа политической системы. Приход на пост Генерального секретаря ЦК КПСС М. С. Горбачёва"
            },
            {
                title: "1989 ",
                text: "Падение Берлинской стены и объединение Германии"
            },
            {
                title: "1991",
                text: "Окончательный, второй по счету распад Югославии"
            },
            {
                title: "1991",
                text: "Распад СССР"
            },
        ]
    },


]